DataProcessors/ЗаполнениеМалоценкиПоОстаткам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ЗаполнениеМалоценкиПоОстаткам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокОбъект</Name>
					<Comment>Документ для которого необходимо заполнение</Comment>
					<Type>
						<v8:Type>cfg:DocumentObject.ПеремещениеМалоценкиВЭксплуатации</v8:Type>
						<v8:Type>cfg:DocumentObject.СписаниеМалоценкиИзЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаМалоценки</Name>
					<Comment>Таблица, для которой требуется заполнение</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостроительЗапроса</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отбор</Name>
					<Type>
						<v8:Type>cfg:Filter</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ПартииМалоценкиВЭксплуатации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииМалоценкиВЭксплуатации</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КодОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодыОперацийПартииМалоценкиВЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеПартий</Name>
					<Comment>Запись сформирована при списании партий</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПартияМалоценкиВЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПередачаМалоценкиВЭксплуатацию</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатковМалоценкиВЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазначениеИспользования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НазначенияИспользования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОприходования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПроизводстваЗаСмену</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатковМалоценкиВЭксплуатации</v8:Type>
						<v8:Type>cfg:DocumentRef.Партия</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКому</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<Comment>(Регл)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДополнительный</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсходнойПроводки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратТекущегоМесяца</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Catalogs/НазначенияИспользования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>НазначенияИспользования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СрокПолезногоИспользования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтраженияРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияРасходовПоАмортизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМалоценки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМалоценки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетПередачиБУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетАмортизацииБУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬНалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетБУДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ЗаполнениеМалоценкиПоОстаткам/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ 
// 

// Хранит признак ДокОбъекта "Указывать партию"
Перем  мУказыватьПартию;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ 
// 

// Процедура перегружает значения отбора
// из реквизита обработки "Отбор"
// в отбор построителя запроса
// 
Процедура СкопироватьОтбор(ОтборИсточник, ОтборПриемник, ТолькоИспользуемые = Ложь) Экспорт
	
	// Очистка отбора приемника
	КвоЭлементов = ОтборПриемник.Количество() - 1;
	
	Для Н = 0 По КвоЭлементов Цикл
	
		ОтборПриемник.Удалить(КвоЭлементов - Н);	
	
	КонецЦикла;
	
	// Загрузка элементов отбора
	КвоЭлементов = ОтборИсточник.Количество() - 1;
	
	Для Н = 0 По КвоЭлементов Цикл
		
		ОбратныйИндекс = КвоЭлементов - Н;
		Элемент        = ОтборИсточник[ОбратныйИндекс];
		
		Если (НЕ ТолькоИспользуемые) ИЛИ Элемент.Использование Тогда
			
			Если ЗначениеЗаполнено(Элемент.ПутьКДанным) Тогда
				
				ЭлементПриемника = ОтборПриемник.Добавить(Элемент.ПутьКДанным);
				
			Иначе
				
				ЭлементПриемника = Неопределено;
				
			КонецЕсли;
			
			Если ЭлементПриемника <> Неопределено Тогда
				
				Попытка
				
					ЭлементПриемника.ВидСравнения  = Элемент.ВидСравнения;
					ЭлементПриемника.Значение	   = Элемент.Значение;
					ЭлементПриемника.ЗначениеС	   = Элемент.ЗначениеС;
					ЭлементПриемника.ЗначениеПо	   = Элемент.ЗначениеПо;
					ЭлементПриемника.Использование = Элемент.Использование;
					
				
				Исключение
					
					ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Элемент отбора <';uk='Елемент відбору <'") + Элемент + ">:" + Символы.ПС + Символы.Таб + ОписаниеОшибки()
					                 + Символы.ПС + Символы.Таб + НСтр("ru='Элемент удален.';uk='Елемент вилучений.'"));
					
					ОтборПриемник.Удалить(ОтборПриемник.Индекс(ЭлементПриемника));
					ОтборИсточник.Удалить(ОбратныйИндекс);
					
				КонецПопытки;
				
			Иначе
				
				ОбщегоНазначения.СообщитьОбОшибке(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Элемент отбора <%1> не входит в число допустимых."
"	Элемент удален.';uk='Елемент відбору <%1> не входить до числа припустимих."
"	Елемент вилучено.'"), Элемент));
				ОтборИсточник.Удалить(ОбратныйИндекс);
				
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры 

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ 
// 

Процедура ВыполнитьЗаполнение() Экспорт

	ЭтоДокПеремещение = (ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПеремещениеМалоценкиВЭксплуатации"));
	
	// Перегрузка значений из реквизита формы "Отбор"
	// в отбор построителя запроса
	СкопироватьОтбор(Отбор, ПостроительЗапроса.Отбор, Истина);
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Заполнение табличной части ""%1"" документа %2.';uk='Заповнення табличної частини ""%1"" документа %2.'"), Метаданные.НайтиПоТипу(ТипЗнч(ТаблицаМалоценки)).Представление(), ДокОбъект);
	
	ПостроительЗапроса.Выполнить();
	
	Если ПостроительЗапроса.Результат.Пустой() Тогда
		
		ОбщегоНазначения.СообщитьИнформацию(НСтр("ru='Нет данных для заполнения!';uk='Немає даних для заповнення!'"), Заголовок);	
		                                                                              
	КонецЕсли;
	
	//|ПО
	//|	Номенклатура,
	//|	ПартияМалоценкиВЭксплуатации,
	//|	ФизЛицо,
	//|	НазначениеИспользования,
	//|	НалоговоеНазначение,
	//|	ХарактеристикаНоменклатуры,
	//|	СерияНоменклатуры
	
	ТаблицаРезультатаЗапроса = ПостроительЗапроса.Результат.Выгрузить();
	ТаблицаРезультатаЗапроса.Очистить();
	
	ОбходПоНоменклатуре = ПостроительЗапроса.Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ОбходПоНоменклатуре.Следующий() Цикл
		ОбходПоДокументу = ОбходПоНоменклатуре.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ОбходПоДокументу.Следующий() Цикл
			ОбходПоФизЛицам = ОбходПоДокументу.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ОбходПоФизЛицам.Следующий() Цикл
				ОбходПоНазначениюИспользования = ОбходПоФизЛицам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ОбходПоНазначениюИспользования.Следующий() Цикл
					ОбходПоНалогововуНазначению = ОбходПоНазначениюИспользования.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ОбходПоНалогововуНазначению.Следующий() Цикл
						ОбходПоХарактеристикам = ОбходПоНалогововуНазначению.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ОбходПоХарактеристикам.Следующий() Цикл
							ОбходПоСериям = ОбходПоХарактеристикам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							Пока ОбходПоСериям.Следующий() Цикл
								
								НоваяСтрокаТаблицаРезультатаЗапроса = ТаблицаРезультатаЗапроса.Добавить();
								ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицаРезультатаЗапроса, ОбходПоСериям);
								
							КонецЦикла;
						КонецЦикла;
					КонецЦикла;
					
					ТаблицаОстатковУУ = ТаблицаРезультатаЗапроса.Скопировать();
					ТаблицаОстатковУУ.Свернуть("ХарактеристикаНоменклатуры, СерияНоменклатуры", "КоличествоУУ");
					
					ТаблицаОстатковБУ = ТаблицаРезультатаЗапроса.Скопировать();
					ТаблицаОстатковБУ.Свернуть("НалоговоеНазначение", "КоличествоБУ");
					
					ТаблицаОбъединенная = СформироватьОбъединеннуюТаблицу(ТаблицаРезультатаЗапроса, ТаблицаОстатковУУ, ТаблицаОстатковБУ);
					
					Для Каждого СтрокаТаблицы Из ТаблицаОбъединенная Цикл
						
						НоваяСтрока = ТаблицаМалоценки.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ОбходПоНазначениюИспользования);
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
							
						Если мУказыватьПартию Тогда
							НоваяСтрока.ПартияМалоценкиВЭксплуатации = ОбходПоНазначениюИспользования.ПартияМалоценкиВЭксплуатации;
						Иначе	
							НоваяСтрока.ПартияМалоценкиВЭксплуатации = Неопределено;
						КонецЕсли;
						
						Если ЭтоДокПеремещение Тогда
							НоваяСтрока.НазначениеИспользованияНовое = ОбходПоНазначениюИспользования.НазначениеИспользования;
						КонецЕсли;
						
					КонецЦикла;	
					
					ТаблицаРезультатаЗапроса.Очистить();
					
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;	
	
КонецПроцедуры // СформироватьОтчет()

Функция СформироватьОбъединеннуюТаблицу(ТаблицаРезультатаЗапроса, ТаблицаОстатковУУ, ТаблицаОстатковБУ)

	// Если есть остатки по одному из учетов (УУ или БУ), а требуется по двум учетам - всё равно добавляем строки
	
	Если ТаблицаРезультатаЗапроса.Количество() <= 1 Тогда
		ТаблицаРезультат = ТаблицаРезультатаЗапроса.Скопировать();
		Если ТаблицаРезультат.Итог("КоличествоУУ") > 0 Тогда
			ТаблицаРезультат.Колонки.КоличествоУУ.Имя 	= "Количество";
		ИначеЕсли ТаблицаРезультат.Итог("КоличествоБУ") > 0 Тогда
			ТаблицаРезультат.Колонки.КоличествоБУ.Имя 	= "Количество";
		КонецЕсли;	
		Возврат ТаблицаРезультат;	
	КонецЕсли;	
	
	ТаблицаРезультат = ТаблицаОстатковБУ.СкопироватьКолонки();
	Для Каждого Колонка Из ТаблицаОстатковУУ.Колонки Цикл
		Если ТаблицаРезультат.Колонки.Найти(Колонка.Имя) = Неопределено Тогда
			ТаблицаРезультат.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
		КонецЕсли; 
	КонецЦикла; 
	
	Если ТаблицаОстатковБУ.Итог("КоличествоБУ") > 0 Тогда
		Для Каждого СтрокаБУ Из ТаблицаОстатковБУ Цикл
			КвоСписуемБУ = СтрокаБУ.КоличествоБУ;
			
			Если КвоСписуемБУ = 0 Тогда
				Продолжить;
			КонецЕсли; 
			
			Для Каждого СтрокаУУ Из ТаблицаОстатковУУ Цикл
				
				Если СтрокаУУ.КоличествоУУ > 0 Тогда
					КвоСписуем = Мин(СтрокаУУ.КоличествоУУ, КвоСписуемБУ);
					
					// добавляем строки в результирующую таблицу
					СтрокаРезультат = ТаблицаРезультат.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаРезультат, СтрокаБУ);
					ЗаполнитьЗначенияСвойств(СтрокаРезультат, СтрокаУУ);
					СтрокаРезультат.КоличествоБУ = КвоСписуем;
					СтрокаРезультат.КоличествоУУ = КвоСписуем;
					
					СтрокаУУ.КоличествоУУ = СтрокаУУ.КоличествоУУ - КвоСписуем;
					
					КвоСписуемБУ = КвоСписуемБУ - КвоСписуем;
					
				КонецЕсли; 
				
				Если КвоСписуемБУ = 0 Тогда
					Прервать;
				КонецЕсли; 
				
			КонецЦикла; 
			
			// если КвоСписуемБУ > 0 - то в УУ уже нет такой номенклатуры
			Если КвоСписуемБУ > 0 Тогда
				СтрокаРезультат = ТаблицаРезультат.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаРезультат, СтрокаБУ);
				СтрокаРезультат.КоличествоБУ = КвоСписуемБУ;
			КонецЕсли; 
			
		КонецЦикла;
	ИначеЕсли ТаблицаОстатковУУ.Итог("КоличествоУУ") > 0 Тогда	
		Для Каждого СтрокаУУ Из ТаблицаОстатковУУ Цикл
			Если СтрокаУУ.КоличествоУУ > 0 Тогда
				// добавляем строки в результирующую таблицу
				СтрокаРезультат = ТаблицаРезультат.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаРезультат, СтрокаУУ);
			КонецЕсли;	
		КонецЦикла;			
	КонецЕсли;	
	
	Если ТаблицаРезультат.Итог("КоличествоУУ") > 0 Тогда
		ТаблицаРезультат.Колонки.КоличествоУУ.Имя 	= "Количество";
	ИначеЕсли ТаблицаРезультат.Итог("КоличествоБУ") > 0 Тогда
		ТаблицаРезультат.Колонки.КоличествоБУ.Имя 	= "Количество";
	КонецЕсли;	
	
	Возврат ТаблицаРезультат;
	
КонецФункции // СформироватьОбъединеннуюТаблицу()	

// Процедура - заполняет начальные настройки заполнения
//
Процедура ЗаполнитьНачальныеНастройки(Отказ) Экспорт
	
	Если ТаблицаМалоценки = Неопределено Тогда
		
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Данная обработка служебная и вызывается при необходимости заполнить табличную часть документов по остаткам';uk='Дана обробка службова й викликається при необхідності заповнити табличну частину документів по залишкам'"), Отказ);
		Возврат
		
	КонецЕсли;
	
	УУ = ДокОбъект.ОтражатьВУправленческомУчете;
	БУ = ДокОбъект.ОтражатьВБухгалтерскомУчете;
	
	мУказыватьПартию = ДокОбъект.УказыватьПартию;
	
	ПостроительЗапроса = Новый ПостроительЗапроса;
	
	Если ДокОбъект.ЭтоНовый() Тогда
		
		ПостроительЗапроса.Параметры.Вставить("НаДату", Неопределено);
		
	Иначе
		
		ПостроительЗапроса.Параметры.Вставить("НаДату", ДокОбъект.МоментВремени());
		
	КонецЕсли;
	
	ПостроительЗапроса.Параметры.Вставить("ДатаДокумента"           , ДокОбъект.Дата);
	ПостроительЗапроса.Параметры.Вставить("Организация"             , ДокОбъект.Организация);
	ПостроительЗапроса.Параметры.Вставить("Подразделение"           , ДокОбъект.Подразделение);
	ПостроительЗапроса.Параметры.Вставить("ПодразделениеОрганизации", ДокОбъект.ПодразделениеОрганизации);
	ПостроительЗапроса.Параметры.Вставить("СчетМЦ"                  , ПланыСчетов.Хозрасчетный.МалоценныеАктивыВЭксплуатации);
	
	МассивСубконто = Новый Массив(3);
	МассивСубконто[0] = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РаботникиОрганизаций;
	МассивСубконто[1] = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НазначенияИспользования;
	МассивСубконто[2] = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПартииМалоценкиВЭксплуатации;
	ПостроительЗапроса.Параметры.Вставить("СубконтоМЦ", МассивСубконто);
	
	ПостроительЗапроса.Текст = 
	"ВЫБРАТЬ
	|	Партии.Номенклатура                                     КАК Номенклатура,
	|	Партии.ХарактеристикаНоменклатуры                       КАК ХарактеристикаНоменклатуры,
	|	Партии.СерияНоменклатуры                                КАК СерияНоменклатуры,
	|	Партии.Номенклатура.ЕдиницаХраненияОстатков             КАК ЕдиницаИзмерения,
	|	Партии.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК Коэффициент,
	|	Партии.ПартияМалоценкиВЭксплуатации                     КАК ПартияМалоценкиВЭксплуатации,
	|	Партии.НалоговоеНазначение                              КАК НалоговоеНазначение,
	|	Партии.ФизЛицо                                          КАК ФизЛицо,
	|	Партии.НазначениеИспользования    						КАК НазначениеИспользования,
	|	ЕСТЬNULL(Партии.КоличествоУУ, 0) 						КАК КоличествоУУ,
	|	ЕСТЬNULL(Партии.КоличествоБУ, 0) 						КАК КоличествоБУ
	|{ВЫБРАТЬ
	|	Номенклатура                                     КАК Номенклатура,
	|	ХарактеристикаНоменклатуры                       КАК ХарактеристикаНоменклатуры,
	|	СерияНоменклатуры                                КАК СерияНоменклатуры,
	|	ЕдиницаИзмерения             					 КАК ЕдиницаИзмерения,
	|	Коэффициент 									 КАК Коэффициент,
	|	ПартияМалоценкиВЭксплуатации                     КАК ПартияМалоценкиВЭксплуатации,
	|	НазначениеИспользования                          КАК НазначениеИспользования,
	|	НалоговоеНазначение                              КАК НалоговоеНазначение,
	|	ФизЛицо                                          КАК ФизЛицо,
	|	КоличествоУУ                                     КАК КоличествоУУ,
	|	КоличествоБУ                                     КАК КоличествоБУ}
	|ИЗ
	|	(" + ?(УУ, "
	|	 ВЫБРАТЬ
	|		ПартииУУ.ФизЛицо                    КАК ФизЛицо,
	|		ПартииУУ.Номенклатура               КАК Номенклатура,
	|		ПартииУУ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ПартииУУ.СерияНоменклатуры          КАК СерияНоменклатуры,
	|		ПартииУУ.НазначениеИспользования    КАК НазначениеИспользования,
	|		ПартииУУ.ПартияМалоценкиВЭксплуатации КАК ПартияМалоценкиВЭксплуатации,
	|		СУММА(ПартииУУ.КоличествоОстаток)   КАК КоличествоУУ,
	|		0                   				КАК КоличествоБУ,
 	|		ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка) 	КАК НалоговоеНазначение,
	|		ПартииУУ.Номенклатура.ЕдиницаХраненияОстатков   			КАК ЕдиницаИзмерения,
	|		ПартииУУ.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент 	КАК Коэффициент
	|	{ВЫБРАТЬ
	|		Номенклатура,
	|		ХарактеристикаНоменклатуры,
	|		СерияНоменклатуры,
	|		ПартияМалоценкиВЭксплуатации,
	|		ФизЛицо,
	|		НазначениеИспользования}
	|	ИЗ
	|		РегистрНакопления.ПартииМалоценкиВЭксплуатации.Остатки(&НаДату, 
	|		                  
	|		                  {Номенклатура.*               КАК Номенклатура,
	|		                   ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры,
	|		                   СерияНоменклатуры.*          КАК СерияНоменклатуры,
	|		                   ПартияМалоценкиВЭксплуатации.*           КАК ПартияМалоценкиВЭксплуатации,
	|		                   ФизЛицо.*                    КАК ФизЛицо,
	|		                   НазначениеИспользования.*    КАК НазначениеИспользования,
	|							ВЫБОР
	|								КОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ПартияМалоценкиВЭксплуатации.Дата,ДЕНЬ), МЕСЯЦ, НазначениеИспользования.СрокПолезногоИспользования) <= НАЧАЛОПЕРИОДА(&ДатаДокумента, ДЕНЬ)
	|								ТОГДА ИСТИНА
	|								ИНАЧЕ ЛОЖЬ
	|							КОНЕЦ КАК СИстекшимСроком,
	|		                   РАЗНОСТЬДАТ(ПартияМалоценкиВЭксплуатации.Дата, &ДатаДокумента, МЕСЯЦ) КАК СрокВЭксплуатации,
	|		                   НАЧАЛОПЕРИОДА(ПартияМалоценкиВЭксплуатации.Дата, ДЕНЬ)                КАК ДатаПередачи,
	|		                   ДокументОприходования.*      КАК ДокументОприходования}) КАК ПартииУУ
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПартииУУ.ФизЛицо,
	|		ПартииУУ.Номенклатура,
	|		ПартииУУ.ХарактеристикаНоменклатуры,
	|		ПартииУУ.СерияНоменклатуры,
	|		ПартииУУ.ПартияМалоценкиВЭксплуатации,
	|		ПартииУУ.НазначениеИспользования", "") + ?(УУ И БУ, "
	|	
	|	ОБЪЕДИНИТЬ ВСЕ", "") + ?(БУ, "
	|	
	|
	|	ВЫБРАТЬ
	|		ХозрасчетныйОстатки.Субконто1                             КАК ФизЛицо,
	|		ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 
	|	         КАК Справочник.НазначенияИспользования).Владелец КАК Номенклатура,
	|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) 													  КАК ХарактеристикаНоменклатуры,
	|		ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) 													  КАК СерияНоменклатуры,
	|		ХозрасчетныйОстатки.Субконто2                             КАК НазначениеИспользования,
	|		ХозрасчетныйОстатки.Субконто3                             КАК ПартияМалоценкиВЭксплуатации,
	|		0                   									  КАК КоличествоУУ,
	|		СУММА(ХозрасчетныйОстатки.КоличествоОстатокДт)            КАК КоличествоБУ,
	|		ХозрасчетныйОстатки.НалоговоеНазначение 				  КАК НалоговоеНазначение,
	|		ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 
	|	              КАК Справочник.НазначенияИспользования).Владелец.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
	|		ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 
	|	              КАК Справочник.НазначенияИспользования).Владелец.ЕдиницаХраненияОстатков.Коэффициент КАК Коэффициент
	|	{ВЫБРАТЬ
	|		ФизЛицо,
	|		Номенклатура,
	|		НазначениеИспользования,
	|		НалоговоеНазначение,
	|		ПартияМалоценкиВЭксплуатации,
	|		КоличествоБУ,
	|		ЕдиницаИзмерения}
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Остатки(
	|		               &НаДату,
	|		               Счет = &СчетМЦ,
	|		               &СубконтоМЦ,
	|		               Организация = &Организация
	|		               {ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица).*                  КАК ФизЛицо,
	|		               ВЫРАЗИТЬ(Субконто2 КАК Справочник.НазначенияИспользования).Владелец.* КАК Номенклатура,
	|		               ВЫРАЗИТЬ(Субконто2 КАК Справочник.НазначенияИспользования).*          КАК НазначениеИспользования,
	|		               Субконто3                                                             КАК ПартияМалоценкиВЭксплуатации,
	|		               НалоговоеНазначение                                                   КАК НалоговоеНазначение,
	|						ВЫБОР
	|							КОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Субконто3.Дата,ДЕНЬ), МЕСЯЦ, Субконто2.СрокПолезногоИспользования) <= НАЧАЛОПЕРИОДА(&ДатаДокумента, ДЕНЬ)
	|							ТОГДА ИСТИНА
	|							ИНАЧЕ ЛОЖЬ
	|						КОНЕЦ КАК СИстекшимСроком,
	|		               РАЗНОСТЬДАТ(Субконто3.Дата, &ДатаДокумента, МЕСЯЦ)                    КАК СрокВЭксплуатации,
	|		               НАЧАЛОПЕРИОДА(Субконто3.Дата, ДЕНЬ) КАК ДатаПередачи}) КАК ХозрасчетныйОстатки
	|
	|	СГРУППИРОВАТЬ ПО
	|		ХозрасчетныйОстатки.Субконто2,
	|		ХозрасчетныйОстатки.Субконто3,
 	|		ХозрасчетныйОстатки.НалоговоеНазначение,
	|		ХозрасчетныйОстатки.Субконто1", "") + "
	|	
	|	) КАК Партии
	|	
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры,
	|	СерияНоменклатуры,
	|	ФизЛицо,
	|	НазначениеИспользования,
	|	ПартияМалоценкиВЭксплуатации
	|	
	|ИТОГИ 
	|	СУММА(КоличествоУУ),
	|	СУММА(КоличествоБУ)	
	|ПО
	|	Номенклатура,
	|	ПартияМалоценкиВЭксплуатации,
	|	ФизЛицо,
	|	НазначениеИспользования,
	|	НалоговоеНазначение,
	|	ХарактеристикаНоменклатуры,
	|	СерияНоменклатуры
	|";

	
	ДоступныеПоля = ПостроительЗапроса.ДоступныеПоля;
	
	// Заполнение пользовательских представлений для доступных полей
	СтруктураПредставлениеПолей = Новый Структура;
	СтруктураПредставлениеПолей.Вставить("Номенклатура"					, НСтр("ru='Малоценный актив';uk='Малоцінний актив'"));
	СтруктураПредставлениеПолей.Вставить("ХарактеристикаНоменклатуры"	, НСтр("ru='Характеристика номенклатуры';uk='Характеристика номенклатури'"));
	СтруктураПредставлениеПолей.Вставить("СерияНоменклатуры"         	, НСтр("ru='Серия номенклатуры';uk='Серія номенклатури'"));
	СтруктураПредставлениеПолей.Вставить("ПартияМалоценкиВЭксплуатации"	, НСтр("ru='Партия малоценки в эксплуатации';uk='Партія малоцінки в експлуатації'"));
	СтруктураПредставлениеПолей.Вставить("ДатаПередачи"              	, НСтр("ru='Дата передачи в эксплуатацию';uk='Дата передачі в експлуатацію'"));
	СтруктураПредставлениеПолей.Вставить("СрокВЭксплуатации"         	, НСтр("ru='Месяцев в эксплуатации на дату документа';uk='Місяців в експлуатації на дату документа'"));
	СтруктураПредставлениеПолей.Вставить("ФизЛицо"                   	, НСтр("ru='Работник';uk='Працівник'"));
	СтруктураПредставлениеПолей.Вставить("НазначениеИспользования"   	, НСтр("ru='Назначение использования';uk='Призначення використання'"));
	СтруктураПредставлениеПолей.Вставить("НалоговоеНазначение"   		, НСтр("ru='Налоговое назначение';uk='Податкове призначення'"));
	СтруктураПредставлениеПолей.Вставить("СИстекшимСроком"         	 	, НСтр("ru='С истёкшим сроком';uk='Зі строком, що закінчився'"));
	
	Для каждого КлючЗначение Из СтруктураПредставлениеПолей Цикл
		
		Поле = ДоступныеПоля.Найти(КлючЗначение.Ключ);
		
		Если Поле <> Неопределено  Тогда
			
			Поле.Представление = КлючЗначение.Значение;			
			
		КонецЕсли;		
	
	КонецЦикла;
	
	
	// заполнение доступных полей для реквизита обработки
	Отбор.УстановитьДоступныеПоля(ДоступныеПоля);
	
	// поля по умолчанию                                                                
	Отбор.Добавить("Номенклатура");
	Отбор.Добавить("ФизЛицо");
	//Дандали В. 25.06.2024 +
	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПеремещениеМалоценкиВЭксплуатации") 
		И ЗначениеЗаполнено(ДокОбъект.ФилЛицоОтправителя) Тогда
		Отбор.ФизЛицо.Значение 		= ДокОбъект.ФилЛицоОтправителя;
		Отбор.ФизЛицо.Использование = Истина;
	КонецЕсли;
	//Дандали В. 25.06.2024 -
	
	Отбор.Добавить("ДатаПередачи"                                      , , НСтр("ru='Дата передачи в эксплуатацию';uk='Дата передачі в експлуатацію'"));
	Отбор.Добавить("СрокВЭксплуатации"                                 , , НСтр("ru='Месяцев в эксплуатации на дату документа';uk='Місяців в експлуатації на дату документа'"));
	Отбор.Добавить("НазначениеИспользования.СрокПолезногоИспользования", , НСтр("ru='Срок полезного использования';uk='Строк корисного використання'"));
	Отбор.Добавить("СИстекшимСроком"                                   , , НСтр("ru='С истёкшим сроком';uk='Зі строком, що закінчився'"));
	
	ПостроительЗапроса.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;
	
КонецПроцедуры // ЗаполнитьНачальныеНастройки()
